{"@context":{"@language":"en","@vocab":"https://schema.org/","citeAs":"cr:citeAs","column":"cr:column","conformsTo":"dct:conformsTo","cr":"http://mlcommons.org/croissant/","data":{"@id":"cr:data","@type":"@json"},"dataBiases":"cr:dataBiases","dataCollection":"cr:dataCollection","dataType":{"@id":"cr:dataType","@type":"@vocab"},"dct":"http://purl.org/dc/terms/","extract":"cr:extract","field":"cr:field","fileProperty":"cr:fileProperty","fileObject":"cr:fileObject","fileSet":"cr:fileSet","format":"cr:format","includes":"cr:includes","isEnumeration":"cr:isEnumeration","isLiveDataset":"cr:isLiveDataset","jsonPath":"cr:jsonPath","key":"cr:key","md5":"cr:md5","parentField":"cr:parentField","path":"cr:path","personalSensitiveInformation":"cr:personalSensitiveInformation","recordSet":"cr:recordSet","references":"cr:references","regex":"cr:regex","repeated":"cr:repeated","replace":"cr:replace","sc":"https://schema.org/","separator":"cr:separator","source":"cr:source","subField":"cr:subField","transform":"cr:transform","wd":"https://www.wikidata.org/wiki/"},"alternateName":"Using Deep Learning to Annotate the Protein Universe","conformsTo":"http://mlcommons.org/croissant/1.0","license":{"@type":"sc:CreativeWork","name":"CC0: Public Domain","url":"https://creativecommons.org/publicdomain/zero/1.0/"},"distribution":[{"contentUrl":"https://www.kaggle.com/api/v1/datasets/download/googleai/pfam-seed-random-split","contentSize":"493.094 MB","encodingFormat":"application/zip","@id":"archive.zip","@type":"cr:FileObject","name":"archive.zip","description":"Archive containing all the contents of the Pfam seed random split dataset"}],"keywords":["subject \u003E science and technology \u003E computer science \u003E programming","subject \u003E people and society \u003E law","subject \u003E science and technology \u003E computer science","subject \u003E earth and nature"],"isAccessibleForFree":true,"isLiveDataset":true,"includedInDataCatalog":{"@type":"sc:DataCatalog","name":"Kaggle","url":"https://www.kaggle.com"},"creator":{"@type":"sc:Organization","name":"Google Research","url":"/organizations/googleai","image":"https://storage.googleapis.com/kaggle-organizations/1623/thumbnail.png?r=141"},"publisher":{"@type":"sc:Organization","name":"Kaggle","url":"https://www.kaggle.com/organizations/kaggle","image":"https://storage.googleapis.com/kaggle-organizations/4/thumbnail.png"},"thumbnailUrl":"https://storage.googleapis.com/kaggle-datasets-images/new-version-temp-images/default-backgrounds-24.png-2839240/dataset-card.png","dateModified":"2019-04-19T03:32:35.937","datePublished":"2019-04-19T04:18:20.4178101","@type":"sc:Dataset","name":"Pfam seed random split","url":"https://www.kaggle.com/datasets/googleai/pfam-seed-random-split","description":"## Problem description \nThis directory contains data to train a model to predict the function of protein domains, based\non the PFam dataset.\n\nDomains are functional sub-parts of proteins; much like images in ImageNet are pre segmented to \ncontain exactly one object class, this data is presegmented to contain exactly and only one\ndomain.\n\nThe purpose of the dataset is to repose the PFam seed dataset as a multiclass classification \nmachine learning task.\n \nThe task is: given the amino acid sequence of the protein domain, predict which class it belongs\nto. There are about 1 million training examples, and 18,000 output classes.\n\n## Data structure\nThis data is more completely described by the publication \u0022Can Deep Learning\nClassify the Protein Universe\u0022, Bileschi et al.\n\n### Data split and layout\nThe approach used to partition the data into training/dev/testing folds is a random split.\n\n- Training data should be used to train your models.\n- Dev (development) data should be used in a close validation loop (maybe\n  for hyperparameter tuning or model validation).\n- Test data should be reserved for much less frequent evaluations - this\n  helps avoid overfitting on your test data, as it should only be used\n  infrequently.\n\n### File content\nEach fold (train, dev, test) has a number of files in it. Each of those files\ncontains csv on each line, which has the following fields:\n\n    sequence: HWLQMRDSMNTYNNMVNRCFATCIRSFQEKKVNAEEMDCTKRCVTKFVGYSQRVALRFAE \n    family_accession: PF02953.15\n    sequence_name: C5K6N5_PERM5/28-87\n    aligned_sequence: ....HWLQMRDSMNTYNNMVNRCFATCI...........RS.F....QEKKVNAEE.....MDCT....KRCVTKFVGYSQRVALRFAE \n    family_id: zf-Tim10_DDP\n\nDescription of fields:\n- sequence: These are usually the input features to your model. Amino acid sequence for this domain.\n  There are 20 very common amino acids (frequency \u0026gt; 1,000,000), and 4 amino acids that are quite \n  uncommon: X, U, B, O, Z.\n- family_accession: These are usually the labels for your model. Accession number in form PFxxxxx.y \n  (Pfam), where xxxxx is the family accession, and y is the version number. \n  Some values of y are greater than ten, and so \u0027y\u0027 has two digits.\n- family_id: One word name for family.\n- sequence_name: Sequence name, in the form \u0022$uniprot_accession_id/$start_index-$end_index\u0022.\n- aligned_sequence: Contains a single sequence from the multiple sequence alignment (with the rest of the members of \n  the family in seed, with gaps retained.\n\nGenerally, the \u0060family_accession\u0060 field is the label, and the sequence\n(or aligned sequence) is the training feature.\n\nThis sequence corresponds to a _domain_, not a full protein.\n\nThe contents of these fields is the same as to the data provided in Stockholm\nformat by PFam at\nftp://ftp.ebi.ac.uk/pub/databases/Pfam/releases/Pfam32.0/Pfam-A.seed.gz\n\n\n[1] Eddy, Sean R. \u0022Accelerated profile HMM searches.\u0022 \n    PLoS computational biology 7.10 (2011): e1002195.\n\n## License\n\nCreative Commons Legal Code\n\nCC0 1.0 Universal\n\n    CREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE\n    LEGAL SERVICES. DISTRIBUTION OF THIS DOCUMENT DOES NOT CREATE AN\n    ATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS\n    INFORMATION ON AN \u0022AS-IS\u0022 BASIS. CREATIVE COMMONS MAKES NO WARRANTIES\n    REGARDING THE USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS\n    PROVIDED HEREUNDER, AND DISCLAIMS LIABILITY FOR DAMAGES RESULTING FROM\n    THE USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS PROVIDED\n    HEREUNDER.\n\nStatement of Purpose\n\nThe laws of most jurisdictions throughout the world automatically confer\nexclusive Copyright and Related Rights (defined below) upon the creator\nand subsequent owner(s) (each and all, an \u0022owner\u0022) of an original work of\nauthorship and/or a database (each, a \u0022Work\u0022).\n\nCertain owners wish to permanently relinquish those rights to a Work for\nthe purpose of contributing to a commons of creative, cultural and\nscientific works (\u0022Commons\u0022) that the public can reliably and without fear\nof later claims of infringement build upon, modify, incorporate in other\nworks, reuse and redistribute as freely as possible in any form whatsoever\nand for any purposes, including without limitation commercial purposes.\nThese owners may contribute to the Commons to promote the ideal of a free\nculture and the further production of creative, cultural and scientific\nworks, or to gain reputation or greater distribution for their Work in\npart through the use and efforts of others.\n\nFor these and/or other purposes and motivations, and without any\nexpectation of additional consideration or compensation, the person\nassociating CC0 with a Work (the \u0022Affirmer\u0022), to the extent that he or she\nis an owner of Copyright and Related Rights in the Work, voluntarily\nelects to apply CC0 to the Work and publicly distribute the Work under its\nterms, with knowledge of his or her Copyright and Related Rights in the\nWork and the meaning and intended legal effect of CC0 on those rights.\n\n1. Copyright and Related Rights. A Work made available under CC0 may be\nprotected by copyright and related or neighboring rights (\u0022Copyright and\nRelated Rights\u0022). Copyright and Related Rights include, but are not\nlimited to, the following:\n\n  i. the right to reproduce, adapt, distribute, perform, display,\n     communicate, and translate a Work;\n ii. moral rights retained by the original author(s) and/or performer(s);\niii. publicity and privacy rights pertaining to a person\u0027s image or\n     likeness depicted in a Work;\n iv. rights protecting against unfair competition in regards to a Work,\n     subject to the limitations in paragraph 4(a), below;\n  v. rights protecting the extraction, dissemination, use and reuse of data\n     in a Work;\n vi. database rights (such as those arising under Directive 96/9/EC of the\n     European Parliament and of the Council of 11 March 1996 on the legal\n     protection of databases, and under any national implementation\n     thereof, including any amended or successor version of such\n     directive); and\nvii. other similar, equivalent or corresponding rights throughout the\n     world based on applicable law or treaty, and any national\n     implementations thereof.\n\n2. Waiver. To the greatest extent permitted by, but not in contravention\nof, applicable law, Affirmer hereby overtly, fully, permanently,\nirrevocably and unconditionally waives, abandons, and surrenders all of\nAffirmer\u0027s Copyright and Related Rights and associated claims and causes\nof action, whether now known or unknown (including existing as well as\nfuture claims and causes of action), in the Work (i) in all territories\nworldwide, (ii) for the maximum duration provided by applicable law or\ntreaty (including future time extensions), (iii) in any current or future\nmedium and for any number of copies, and (iv) for any purpose whatsoever,\nincluding without limitation commercial, advertising or promotional\npurposes (the \u0022Waiver\u0022). Affirmer makes the Waiver for the benefit of each\nmember of the public at large and to the detriment of Affirmer\u0027s heirs and\nsuccessors, fully intending that such Waiver shall not be subject to\nrevocation, rescission, cancellation, termination, or any other legal or\nequitable action to disrupt the quiet enjoyment of the Work by the public\nas contemplated by Affirmer\u0027s express Statement of Purpose.\n\n3. Public License Fallback. Should any part of the Waiver for any reason\nbe judged legally invalid or ineffective under applicable law, then the\nWaiver shall be preserved to the maximum extent permitted taking into\naccount Affirmer\u0027s express Statement of Purpose. In addition, to the\nextent the Waiver is so judged Affirmer hereby grants to each affected\nperson a royalty-free, non transferable, non sublicensable, non exclusive,\nirrevocable and unconditional license to exercise Affirmer\u0027s Copyright and\nRelated Rights in the Work (i) in all territories worldwide, (ii) for the\nmaximum duration provided by applicable law or treaty (including future\ntime extensions), (iii) in any current or future medium and for any number\nof copies, and (iv) for any purpose whatsoever, including without\nlimitation commercial, advertising or promotional purposes (the\n\u0022License\u0022). The License shall be deemed effective as of the date CC0 was\napplied by Affirmer to the Work. Should any part of the License for any\nreason be judged legally invalid or ineffective under applicable law, such\npartial invalidity or ineffectiveness shall not invalidate the remainder\nof the License, and in such case Affirmer hereby affirms that he or she\nwill not (i) exercise any of his or her remaining Copyright and Related\nRights in the Work or (ii) assert any associated claims and causes of\naction with respect to the Work, in either case contrary to Affirmer\u0027s\nexpress Statement of Purpose.\n\n4. Limitations and Disclaimers.\n\n a. No trademark or patent rights held by Affirmer are waived, abandoned,\n    surrendered, licensed or otherwise affected by this document.\n b. Affirmer offers the Work as-is and makes no representations or\n    warranties of any kind concerning the Work, express, implied,\n    statutory or otherwise, including without limitation warranties of\n    title, merchantability, fitness for a particular purpose, non\n    infringement, or the absence of latent or other defects, accuracy, or\n    the present or absence of errors, whether or not discoverable, all to\n    the greatest extent permissible under applicable law.\n c. Affirmer disclaims responsibility for clearing rights of other persons\n    that may apply to the Work or any use thereof, including without\n    limitation any person\u0027s Copyright and Related Rights in the Work.\n    Further, Affirmer disclaims responsibility for obtaining any necessary\n    consents, permissions or other rights required for any use of the\n    Work.\n d. Affirmer understands and acknowledges that Creative Commons is not a\n    party to this document and has no duty or obligation with respect to\n    this CC0 or use of the Work."}